# String Properties

---
The SpecTypeIdString type exposes the following members.
| Name| Description
---|---|---
| MultilineText|  Multiline Text, in discipline Common.
| Text|  Text, in discipline Common.
| Url|  URL, in discipline Common.
Top
#### Reference
SpecTypeIdString Class
Autodesk.Revit.DB Namespace